---
kind: type
id: T:Autodesk.Revit.DB.DetailCurveArray
source: html/f01a6bd2-baaf-9551-d713-c08476153e55.htm
---
# Autodesk.Revit.DB.DetailCurveArray

An array that can contain any type of object.

## Syntax (C#)
```csharp
public class DetailCurveArray : APIObject,
	IEnumerable
```